# 2 - Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности. Не использовать множества.
# [1,1,1,1,2,2,2,3,3,3,4] -> [1,2,3,4]

ls = [1, 1, 1, 1, 2, 2, 2, 3, 3, 3, 4]
def NoRepeatElements(list):
    list2 = []
    for i in list:
        if i not in list2:
            list2.append(i)
    return list2
print(NoRepeatElements(ls))



